# Nome: João Emanuel - Matrícula: 162080263 - Data 13/Agosto/2020

## Dataframe

In [1]:
#!pip install pandas
#!conda install pandas

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df['Nome'] = ['Jessica', 'Aline']
df

      Nome
0  Jessica
1    Aline

In [6]:
df['cre'] = [ 7.8, 8.3 ]
df

      Nome  cre
0  Jessica  7.8
1    Aline  8.3

### Dataframe de casos Covid-19 - em 13 de Agosto de 2020

In [7]:
atributos = ['Local', 'Confirmados', 'Novos casos (60  dias)', 'Casos por milhões', 'Casos recuperados', 'Mortes']

In [8]:
atributos

['Local',
 'Confirmados',
 'Novos casos (60  dias)',
 'Casos por milhões',
 'Casos recuperados',
 'Mortes']

In [10]:
data = {
    'Local': ['São Paulo', 'Bahia', 'Ceará', 'Rio de Janeiro', 'Paraíba'],
    'Confirmados': [655181, 203020, 192422, 185610, 92897],
    'Casos por milhão': [14879, 13421, 21760, 11276, 23555],
    'Mortes': [25869, 4135, 8052, 14295, 2071]
}
data

{'Local': ['São Paulo', 'Bahia', 'Ceará', 'Rio de Janeiro', 'Paraíba'],
 'Confirmados': [655181, 203020, 192422, 185610, 92897],
 'Casos por milhão': [14879, 13421, 21760, 11276, 23555],
 'Mortes': [25869, 4135, 8052, 14295, 2071]}

In [11]:
df = pd.DataFrame(data)
df

            Local  Confirmados  Casos por milhão  Mortes
0       São Paulo       655181             14879   25869
1           Bahia       203020             13421    4135
2           Ceará       192422             21760    8052
3  Rio de Janeiro       185610             11276   14295
4         Paraíba        92897             23555    2071

In [12]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df['Local']

0         São Paulo
1             Bahia
2             Ceará
3    Rio de Janeiro
4           Paraíba
Name: Local, dtype: object

In [15]:
df.head()

            Local  Confirmados  Casos por milhão  Mortes
0       São Paulo       655181             14879   25869
1           Bahia       203020             13421    4135
2           Ceará       192422             21760    8052
3  Rio de Janeiro       185610             11276   14295
4         Paraíba        92897             23555    2071

In [16]:
df.tail()

            Local  Confirmados  Casos por milhão  Mortes
0       São Paulo       655181             14879   25869
1           Bahia       203020             13421    4135
2           Ceará       192422             21760    8052
3  Rio de Janeiro       185610             11276   14295
4         Paraíba        92897             23555    2071

In [17]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
df.columns

Index(['Local', 'Confirmados', 'Casos por milhão', 'Mortes'], dtype='object')

In [19]:
atributo = df.columns.values
atributo

array(['Local', 'Confirmados', 'Casos por milhão', 'Mortes'], dtype=object)

In [20]:
atributo[0]

'Local'

In [21]:
df.values

array([['São Paulo', 655181, 14879, 25869],
       ['Bahia', 203020, 13421, 4135],
       ['Ceará', 192422, 21760, 8052],
       ['Rio de Janeiro', 185610, 11276, 14295],
       ['Paraíba', 92897, 23555, 2071]], dtype=object)

In [22]:
df2 = df
del df2['Local']
df2

   Confirmados  Casos por milhão  Mortes
0       655181             14879   25869
1       203020             13421    4135
2       192422             21760    8052
3       185610             11276   14295
4        92897             23555    2071

In [24]:
k = df2.values
print(k)

[[655181  14879  25869]
 [203020  13421   4135]
 [192422  21760   8052]
 [185610  11276  14295]
 [ 92897  23555   2071]]

In [26]:
x = df[['Confirmados', 'Casos por milhão']]
x

   Confirmados  Casos por milhão
0       655181             14879
1       203020             13421
2       192422             21760
3       185610             11276
4        92897             23555

In [27]:
y = df['Mortes']
y

0    25869
1     4135
2     8052
3    14295
4     2071
Name: Mortes, dtype: int64

In [28]:
x = x.values
x

array([[655181,  14879],
       [203020,  13421],
       [192422,  21760],
       [185610,  11276],
       [ 92897,  23555]])

In [29]:
y = y.values
y

array([25869,  4135,  8052, 14295,  2071])